Revit 2026 API

# ViewSheetSetViewOrganizationId Property

---

ElementId to the BrowserOrganization for non-sheet views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual ElementId ViewOrganizationId { get; set; }
```
```vb
Public Overridable Property ViewOrganizationId As ElementId
	Get
	Set
```
```cpp
public:
virtual property ElementId^ ViewOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
abstract ViewOrganizationId : ElementId with get, set
override ViewOrganizationId : ElementId with get, set
```

#### Property Value

ElementId

#### Implements

IViewSheetSetViewOrganizationId

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible. |

Ignored when [!:Autodesk::Revit::DB::PrintSetup::IsAutomatic] is .

#### Reference

ViewSheetSet Class

Autodesk.Revit.DB Namespace